Revit 2027 API
FormattedText.SetItalicStatus(Boolean) Method
 Sets the characters in the entire text to be italic or not italic.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetItalicStatus(
	bool isItalic
)
Public Sub SetItalicStatus (
	isItalic As Boolean
)
public:
void SetItalicStatus(
	bool isItalic
)
member SetItalicStatus :
        isItalic : bool -> unit
Parameters
isItalic Boolean
 The desired italic status of characters in the entire text. True to set italic, false to set not italic.
See Also
Reference
FormattedText Class
SetItalicStatus Overload
Autodesk.Revit.DB Namespace